"""
@Name: tcpip.py
@Auth: Huohuo
@Date: 2023/8/28-9:28
@Desc: 
@Ver : 
code_idea
"""
# ------------------------------------------------------
#                   tcp客户端构建流程
# ------------------------------------------------------
import socket
# ------------------------------------------------------
#                  1-创建socket对象。
# socket是一种通信端点，用于在计算机网络中传输数据
# socket.AF_INET：表示这是一个IPv4地址族
# socket.SOCK_STREAM：这是一个流的socket，即使用TCP协议进行通信
# tcp_socket = socket.socket() 创建socket对象赋值给变量tcp_socket
# ------------------------------------------------------
tcp_socket = socket.socket(socket.AF_INET, socket.SOCK_STREAM)

# ------------------------------------------------------
#                  2-链接服务器
# ------------------------------------------------------
server_addr = ("169.254.247.208", 12345)
tcp_socket.connect(server_addr)

# ------------------------------------------------------
#                  3-发送数据
# ------------------------------------------------------
send_data = input("输入数据：")
tcp_socket.send(send_data.encode("utf-8"))

# ------------------------------------------------------
#                  4-关闭套接字
# ------------------------------------------------------
tcp_socket.close()















def main():
    return 0


if __name__ == '__main__':
    main()
